virtualritz/msp430f249/msp430f249.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SUPPLY_VOLTAGE_SUPERVISOR</name>
      <description>Supply Voltage Supervisor</description>
      <baseAddress>84</baseAddress>
      <registers>
        <register>
          <name>SVSCTL</name>
          <description>SVS Control</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>SVSFG</name>
              <description>SVS Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVSOP</name>
              <description>SVS output (read only)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SVSON</name>
              <description>Switches the SVS on/off</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORON</name>
              <description>Enable POR Generation if Low Voltage</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLD0</name>
              <description>VLD0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLD1</name>
              <description>VLD1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLD2</name>
              <description>VLD2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLD3</name>
              <description>VLD3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMPARATOR_A</name>
      <description>Comparator A</description>
      <baseAddress>88</baseAddress>
      <registers>
        <register>
          <name>CACTL1</name>
          <description>Comparator A Control 1</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>CAIFG</name>
              <description>Comp. A Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAIE</name>
              <description>Comp. A Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAIES</name>
              <description>Comp. A Int. Edge Select: 0:rising / 1:falling</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAON</name>
              <description>Comp. A enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAREF</name>
              <description>Comp. A Internal Reference Select 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAREF_0</name>
                  <description>Comp. A Int. Ref. Select 0 : Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAREF_1</name>
                  <description>Comp. A Int. Ref. Select 1 : 0.25*Vcc</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAREF_2</name>
                  <description>Comp. A Int. Ref. Select 2 : 0.5*Vcc</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAREF_3</name>
                  <description>Comp. A Int. Ref. Select 3 : Vt</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CARSEL</name>
              <description>Comp. A Internal Reference Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAEX</name>
              <description>Comp. A Exchange Inputs</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACTL2</name>
          <description>Comparator A Control 2</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>CAOUT</name>
              <description>Comp. A Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAF</name>
              <description>Comp. A Enable Output Filter</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2CA0</name>
              <description>Comp. A +Terminal Multiplexer</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2CA1</name>
              <description>Comp. A -Terminal Multiplexer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2CA2</name>
              <description>Comp. A -Terminal Multiplexer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2CA3</name>
              <description>Comp. A -Terminal Multiplexer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2CA4</name>
              <description>Comp. A +Terminal Multiplexer</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CASHORT</name>
              <description>Comp. A Short + and - Terminals</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPD</name>
          <description>Comparator A Port Disable</description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>CAPD0</name>
              <description>Comp. A Disable Input Buffer of Port Register .0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD1</name>
              <description>Comp. A Disable Input Buffer of Port Register .1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD2</name>
              <description>Comp. A Disable Input Buffer of Port Register .2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD3</name>
              <description>Comp. A Disable Input Buffer of Port Register .3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD4</name>
              <description>Comp. A Disable Input Buffer of Port Register .4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD5</name>
              <description>Comp. A Disable Input Buffer of Port Register .5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD6</name>
              <description>Comp. A Disable Input Buffer of Port Register .6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPD7</name>
              <description>Comp. A Disable Input Buffer of Port Register .7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
