virtualritz/msp430f249/msp430f249.svd
        <register>
          <name>ADC12CTL1</name>
          <description>ADC12 Control 1</description>
          <addressOffset>290</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC12BUSY</name>
              <description>ADC12 Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONSEQ</name>
              <description>ADC12 Conversion Sequence Select 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONSEQ_0</name>
                  <description>ADC12 Conversion Sequence Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONSEQ_1</name>
                  <description>ADC12 Conversion Sequence Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONSEQ_2</name>
                  <description>ADC12 Conversion Sequence Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONSEQ_3</name>
                  <description>ADC12 Conversion Sequence Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12SSEL</name>
              <description>ADC12 Clock Source Select 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12SSEL_0</name>
                  <description>ADC12 Clock Source Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SSEL_1</name>
                  <description>ADC12 Clock Source Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SSEL_2</name>
                  <description>ADC12 Clock Source Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SSEL_3</name>
                  <description>ADC12 Clock Source Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12DIV</name>
              <description>ADC12 Clock Divider Select 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12DIV_0</name>
                  <description>ADC12 Clock Divider Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_1</name>
                  <description>ADC12 Clock Divider Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_2</name>
                  <description>ADC12 Clock Divider Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_3</name>
                  <description>ADC12 Clock Divider Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_4</name>
                  <description>ADC12 Clock Divider Select: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_5</name>
                  <description>ADC12 Clock Divider Select: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_6</name>
                  <description>ADC12 Clock Divider Select: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_7</name>
                  <description>ADC12 Clock Divider Select: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISSH</name>
              <description>ADC12 Invert Sample Hold Signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHP</name>
              <description>ADC12 Sample/Hold Pulse Mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHS</name>
              <description>ADC12 Sample/Hold Source 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHS_0</name>
                  <description>ADC12 Sample/Hold Source: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHS_1</name>
                  <description>ADC12 Sample/Hold Source: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHS_2</name>
                  <description>ADC12 Sample/Hold Source: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHS_3</name>
                  <description>ADC12 Sample/Hold Source: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSTARTADD</name>
              <description>ADC12 Conversion Start Address 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSTARTADD_0</name>
                  <description>ADC12 Conversion Start Address: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_1</name>
                  <description>ADC12 Conversion Start Address: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_2</name>
                  <description>ADC12 Conversion Start Address: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_3</name>
                  <description>ADC12 Conversion Start Address: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_4</name>
                  <description>ADC12 Conversion Start Address: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_5</name>
                  <description>ADC12 Conversion Start Address: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_6</name>
                  <description>ADC12 Conversion Start Address: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_7</name>
                  <description>ADC12 Conversion Start Address: 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_8</name>
                  <description>ADC12 Conversion Start Address: 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_9</name>
                  <description>ADC12 Conversion Start Address: 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_10</name>
                  <description>ADC12 Conversion Start Address: 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_11</name>
                  <description>ADC12 Conversion Start Address: 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_12</name>
                  <description>ADC12 Conversion Start Address: 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_13</name>
                  <description>ADC12 Conversion Start Address: 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_14</name>
                  <description>ADC12 Conversion Start Address: 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSTARTADD_15</name>
                  <description>ADC12 Conversion Start Address: 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC12IFG</name>
          <description>ADC12 Interrupt Flag</description>
          <addressOffset>292</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12IE</name>
          <description>ADC12 Interrupt Enable</description>
          <addressOffset>294</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12IV</name>
          <description>ADC12 Interrupt Vector Word</description>
          <addressOffset>296</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
